foxval/esp-idf/components/soc/esp32c/include/soc/host_reg.h
#define HOST_SLC1HOST_INT_ST_REG          (DR_REG_SLCHOST_BASE + 0x5C)
/* HOST_SLC1_BT_RX_NEW_PACKET_INT_ST : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ST  (BIT(25))
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_M  (BIT(25))
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_V  0x1
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ST_S  25
/* HOST_SLC1_HOST_RD_RETRY_INT_ST : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_HOST_RD_RETRY_INT_ST  (BIT(24))
#define HOST_SLC1_HOST_RD_RETRY_INT_ST_M  (BIT(24))
#define HOST_SLC1_HOST_RD_RETRY_INT_ST_V  0x1
#define HOST_SLC1_HOST_RD_RETRY_INT_ST_S  24
/* HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST  (BIT(23))
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_M  (BIT(23))
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_V  0x1
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ST_S  23
/* HOST_SLC1_EXT_BIT3_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT3_INT_ST  (BIT(22))
#define HOST_SLC1_EXT_BIT3_INT_ST_M  (BIT(22))
#define HOST_SLC1_EXT_BIT3_INT_ST_V  0x1
#define HOST_SLC1_EXT_BIT3_INT_ST_S  22
/* HOST_SLC1_EXT_BIT2_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT2_INT_ST  (BIT(21))
#define HOST_SLC1_EXT_BIT2_INT_ST_M  (BIT(21))
#define HOST_SLC1_EXT_BIT2_INT_ST_V  0x1
#define HOST_SLC1_EXT_BIT2_INT_ST_S  21
/* HOST_SLC1_EXT_BIT1_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT1_INT_ST  (BIT(20))
#define HOST_SLC1_EXT_BIT1_INT_ST_M  (BIT(20))
#define HOST_SLC1_EXT_BIT1_INT_ST_V  0x1
#define HOST_SLC1_EXT_BIT1_INT_ST_S  20
/* HOST_SLC1_EXT_BIT0_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT0_INT_ST  (BIT(19))
#define HOST_SLC1_EXT_BIT0_INT_ST_M  (BIT(19))
#define HOST_SLC1_EXT_BIT0_INT_ST_V  0x1
#define HOST_SLC1_EXT_BIT0_INT_ST_S  19
/* HOST_SLC1_RX_PF_VALID_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_RX_PF_VALID_INT_ST  (BIT(18))
#define HOST_SLC1_RX_PF_VALID_INT_ST_M  (BIT(18))
#define HOST_SLC1_RX_PF_VALID_INT_ST_V  0x1
#define HOST_SLC1_RX_PF_VALID_INT_ST_S  18
/* HOST_SLC1_TX_OVF_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TX_OVF_INT_ST  (BIT(17))
#define HOST_SLC1_TX_OVF_INT_ST_M  (BIT(17))
#define HOST_SLC1_TX_OVF_INT_ST_V  0x1
#define HOST_SLC1_TX_OVF_INT_ST_S  17
/* HOST_SLC1_RX_UDF_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_RX_UDF_INT_ST  (BIT(16))
#define HOST_SLC1_RX_UDF_INT_ST_M  (BIT(16))
#define HOST_SLC1_RX_UDF_INT_ST_V  0x1
#define HOST_SLC1_RX_UDF_INT_ST_S  16
/* HOST_SLC1HOST_TX_START_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_TX_START_INT_ST  (BIT(15))
#define HOST_SLC1HOST_TX_START_INT_ST_M  (BIT(15))
#define HOST_SLC1HOST_TX_START_INT_ST_V  0x1
#define HOST_SLC1HOST_TX_START_INT_ST_S  15
/* HOST_SLC1HOST_RX_START_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_RX_START_INT_ST  (BIT(14))
#define HOST_SLC1HOST_RX_START_INT_ST_M  (BIT(14))
#define HOST_SLC1HOST_RX_START_INT_ST_V  0x1
#define HOST_SLC1HOST_RX_START_INT_ST_S  14
/* HOST_SLC1HOST_RX_EOF_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_RX_EOF_INT_ST  (BIT(13))
#define HOST_SLC1HOST_RX_EOF_INT_ST_M  (BIT(13))
#define HOST_SLC1HOST_RX_EOF_INT_ST_V  0x1
#define HOST_SLC1HOST_RX_EOF_INT_ST_S  13
/* HOST_SLC1HOST_RX_SOF_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_RX_SOF_INT_ST  (BIT(12))
#define HOST_SLC1HOST_RX_SOF_INT_ST_M  (BIT(12))
#define HOST_SLC1HOST_RX_SOF_INT_ST_V  0x1
#define HOST_SLC1HOST_RX_SOF_INT_ST_S  12
/* HOST_SLC1_TOKEN1_0TO1_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN1_0TO1_INT_ST  (BIT(11))
#define HOST_SLC1_TOKEN1_0TO1_INT_ST_M  (BIT(11))
#define HOST_SLC1_TOKEN1_0TO1_INT_ST_V  0x1
#define HOST_SLC1_TOKEN1_0TO1_INT_ST_S  11
/* HOST_SLC1_TOKEN0_0TO1_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN0_0TO1_INT_ST  (BIT(10))
#define HOST_SLC1_TOKEN0_0TO1_INT_ST_M  (BIT(10))
#define HOST_SLC1_TOKEN0_0TO1_INT_ST_V  0x1
#define HOST_SLC1_TOKEN0_0TO1_INT_ST_S  10
/* HOST_SLC1_TOKEN1_1TO0_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN1_1TO0_INT_ST  (BIT(9))
#define HOST_SLC1_TOKEN1_1TO0_INT_ST_M  (BIT(9))
#define HOST_SLC1_TOKEN1_1TO0_INT_ST_V  0x1
#define HOST_SLC1_TOKEN1_1TO0_INT_ST_S  9
/* HOST_SLC1_TOKEN0_1TO0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN0_1TO0_INT_ST  (BIT(8))
#define HOST_SLC1_TOKEN0_1TO0_INT_ST_M  (BIT(8))
#define HOST_SLC1_TOKEN0_1TO0_INT_ST_V  0x1
#define HOST_SLC1_TOKEN0_1TO0_INT_ST_S  8
/* HOST_SLC1_TOHOST_BIT7_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT7_INT_ST  (BIT(7))
#define HOST_SLC1_TOHOST_BIT7_INT_ST_M  (BIT(7))
#define HOST_SLC1_TOHOST_BIT7_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT7_INT_ST_S  7
/* HOST_SLC1_TOHOST_BIT6_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT6_INT_ST  (BIT(6))
#define HOST_SLC1_TOHOST_BIT6_INT_ST_M  (BIT(6))
#define HOST_SLC1_TOHOST_BIT6_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT6_INT_ST_S  6
/* HOST_SLC1_TOHOST_BIT5_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT5_INT_ST  (BIT(5))
#define HOST_SLC1_TOHOST_BIT5_INT_ST_M  (BIT(5))
#define HOST_SLC1_TOHOST_BIT5_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT5_INT_ST_S  5
/* HOST_SLC1_TOHOST_BIT4_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT4_INT_ST  (BIT(4))
#define HOST_SLC1_TOHOST_BIT4_INT_ST_M  (BIT(4))
#define HOST_SLC1_TOHOST_BIT4_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT4_INT_ST_S  4
/* HOST_SLC1_TOHOST_BIT3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT3_INT_ST  (BIT(3))
#define HOST_SLC1_TOHOST_BIT3_INT_ST_M  (BIT(3))
#define HOST_SLC1_TOHOST_BIT3_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT3_INT_ST_S  3
/* HOST_SLC1_TOHOST_BIT2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT2_INT_ST  (BIT(2))
#define HOST_SLC1_TOHOST_BIT2_INT_ST_M  (BIT(2))
#define HOST_SLC1_TOHOST_BIT2_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT2_INT_ST_S  2
/* HOST_SLC1_TOHOST_BIT1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT1_INT_ST  (BIT(1))
#define HOST_SLC1_TOHOST_BIT1_INT_ST_M  (BIT(1))
#define HOST_SLC1_TOHOST_BIT1_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT1_INT_ST_S  1
/* HOST_SLC1_TOHOST_BIT0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT0_INT_ST  (BIT(0))
#define HOST_SLC1_TOHOST_BIT0_INT_ST_M  (BIT(0))
#define HOST_SLC1_TOHOST_BIT0_INT_ST_V  0x1
#define HOST_SLC1_TOHOST_BIT0_INT_ST_S  0

