foxval/esp-idf/components/soc/esp32c/include/soc/host_reg.h
#define HOST_SLCHOST_CONF_W11_REG          (DR_REG_SLCHOST_BASE + 0xA8)
/* HOST_SLCHOST_CONF47 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF47  0x000000FF
#define HOST_SLCHOST_CONF47_M  ((HOST_SLCHOST_CONF47_V)<<(HOST_SLCHOST_CONF47_S))
#define HOST_SLCHOST_CONF47_V  0xFF
#define HOST_SLCHOST_CONF47_S  24
/* HOST_SLCHOST_CONF46 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF46  0x000000FF
#define HOST_SLCHOST_CONF46_M  ((HOST_SLCHOST_CONF46_V)<<(HOST_SLCHOST_CONF46_S))
#define HOST_SLCHOST_CONF46_V  0xFF
#define HOST_SLCHOST_CONF46_S  16
/* HOST_SLCHOST_CONF45 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF45  0x000000FF
#define HOST_SLCHOST_CONF45_M  ((HOST_SLCHOST_CONF45_V)<<(HOST_SLCHOST_CONF45_S))
#define HOST_SLCHOST_CONF45_V  0xFF
#define HOST_SLCHOST_CONF45_S  8
/* HOST_SLCHOST_CONF44 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF44  0x000000FF
#define HOST_SLCHOST_CONF44_M  ((HOST_SLCHOST_CONF44_V)<<(HOST_SLCHOST_CONF44_S))
#define HOST_SLCHOST_CONF44_V  0xFF
#define HOST_SLCHOST_CONF44_S  0

#define HOST_SLCHOST_CONF_W12_REG          (DR_REG_SLCHOST_BASE + 0xAC)
/* HOST_SLCHOST_CONF51 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF51  0x000000FF
#define HOST_SLCHOST_CONF51_M  ((HOST_SLCHOST_CONF51_V)<<(HOST_SLCHOST_CONF51_S))
#define HOST_SLCHOST_CONF51_V  0xFF
#define HOST_SLCHOST_CONF51_S  24
/* HOST_SLCHOST_CONF50 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF50  0x000000FF
#define HOST_SLCHOST_CONF50_M  ((HOST_SLCHOST_CONF50_V)<<(HOST_SLCHOST_CONF50_S))
#define HOST_SLCHOST_CONF50_V  0xFF
#define HOST_SLCHOST_CONF50_S  16
/* HOST_SLCHOST_CONF49 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF49  0x000000FF
#define HOST_SLCHOST_CONF49_M  ((HOST_SLCHOST_CONF49_V)<<(HOST_SLCHOST_CONF49_S))
#define HOST_SLCHOST_CONF49_V  0xFF
#define HOST_SLCHOST_CONF49_S  8
/* HOST_SLCHOST_CONF48 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF48  0x000000FF
#define HOST_SLCHOST_CONF48_M  ((HOST_SLCHOST_CONF48_V)<<(HOST_SLCHOST_CONF48_S))
#define HOST_SLCHOST_CONF48_V  0xFF
#define HOST_SLCHOST_CONF48_S  0

#define HOST_SLCHOST_CONF_W13_REG          (DR_REG_SLCHOST_BASE + 0xB0)
/* HOST_SLCHOST_CONF55 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF55  0x000000FF
#define HOST_SLCHOST_CONF55_M  ((HOST_SLCHOST_CONF55_V)<<(HOST_SLCHOST_CONF55_S))
#define HOST_SLCHOST_CONF55_V  0xFF
#define HOST_SLCHOST_CONF55_S  24
/* HOST_SLCHOST_CONF54 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF54  0x000000FF
#define HOST_SLCHOST_CONF54_M  ((HOST_SLCHOST_CONF54_V)<<(HOST_SLCHOST_CONF54_S))
#define HOST_SLCHOST_CONF54_V  0xFF
#define HOST_SLCHOST_CONF54_S  16
/* HOST_SLCHOST_CONF53 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF53  0x000000FF
#define HOST_SLCHOST_CONF53_M  ((HOST_SLCHOST_CONF53_V)<<(HOST_SLCHOST_CONF53_S))
#define HOST_SLCHOST_CONF53_V  0xFF
#define HOST_SLCHOST_CONF53_S  8
/* HOST_SLCHOST_CONF52 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF52  0x000000FF
#define HOST_SLCHOST_CONF52_M  ((HOST_SLCHOST_CONF52_V)<<(HOST_SLCHOST_CONF52_S))
#define HOST_SLCHOST_CONF52_V  0xFF
#define HOST_SLCHOST_CONF52_S  0

#define HOST_SLCHOST_CONF_W14_REG          (DR_REG_SLCHOST_BASE + 0xB4)
/* HOST_SLCHOST_CONF59 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF59  0x000000FF
#define HOST_SLCHOST_CONF59_M  ((HOST_SLCHOST_CONF59_V)<<(HOST_SLCHOST_CONF59_S))
#define HOST_SLCHOST_CONF59_V  0xFF
#define HOST_SLCHOST_CONF59_S  24
/* HOST_SLCHOST_CONF58 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF58  0x000000FF
#define HOST_SLCHOST_CONF58_M  ((HOST_SLCHOST_CONF58_V)<<(HOST_SLCHOST_CONF58_S))
#define HOST_SLCHOST_CONF58_V  0xFF
#define HOST_SLCHOST_CONF58_S  16
/* HOST_SLCHOST_CONF57 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF57  0x000000FF
#define HOST_SLCHOST_CONF57_M  ((HOST_SLCHOST_CONF57_V)<<(HOST_SLCHOST_CONF57_S))
#define HOST_SLCHOST_CONF57_V  0xFF
#define HOST_SLCHOST_CONF57_S  8
/* HOST_SLCHOST_CONF56 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF56  0x000000FF
#define HOST_SLCHOST_CONF56_M  ((HOST_SLCHOST_CONF56_V)<<(HOST_SLCHOST_CONF56_S))
#define HOST_SLCHOST_CONF56_V  0xFF
#define HOST_SLCHOST_CONF56_S  0

#define HOST_SLCHOST_CONF_W15_REG          (DR_REG_SLCHOST_BASE + 0xB8)
/* HOST_SLCHOST_CONF63 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF63  0x000000FF
#define HOST_SLCHOST_CONF63_M  ((HOST_SLCHOST_CONF63_V)<<(HOST_SLCHOST_CONF63_S))
#define HOST_SLCHOST_CONF63_V  0xFF
#define HOST_SLCHOST_CONF63_S  24
/* HOST_SLCHOST_CONF62 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF62  0x000000FF
#define HOST_SLCHOST_CONF62_M  ((HOST_SLCHOST_CONF62_V)<<(HOST_SLCHOST_CONF62_S))
#define HOST_SLCHOST_CONF62_V  0xFF
#define HOST_SLCHOST_CONF62_S  16
/* HOST_SLCHOST_CONF61 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF61  0x000000FF
#define HOST_SLCHOST_CONF61_M  ((HOST_SLCHOST_CONF61_V)<<(HOST_SLCHOST_CONF61_S))
#define HOST_SLCHOST_CONF61_V  0xFF
#define HOST_SLCHOST_CONF61_S  8
/* HOST_SLCHOST_CONF60 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF60  0x000000FF
#define HOST_SLCHOST_CONF60_M  ((HOST_SLCHOST_CONF60_V)<<(HOST_SLCHOST_CONF60_S))
#define HOST_SLCHOST_CONF60_V  0xFF
#define HOST_SLCHOST_CONF60_S  0

#define HOST_SLCHOST_CHECK_SUM0_REG          (DR_REG_SLCHOST_BASE + 0xBC)
/* HOST_SLCHOST_CHECK_SUM0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLCHOST_CHECK_SUM0  0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM0_M  ((HOST_SLCHOST_CHECK_SUM0_V)<<(HOST_SLCHOST_CHECK_SUM0_S))
#define HOST_SLCHOST_CHECK_SUM0_V  0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM0_S  0

#define HOST_SLCHOST_CHECK_SUM1_REG          (DR_REG_SLCHOST_BASE + 0xC0)
/* HOST_SLCHOST_CHECK_SUM1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLCHOST_CHECK_SUM1  0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM1_M  ((HOST_SLCHOST_CHECK_SUM1_V)<<(HOST_SLCHOST_CHECK_SUM1_S))
#define HOST_SLCHOST_CHECK_SUM1_V  0xFFFFFFFF
#define HOST_SLCHOST_CHECK_SUM1_S  0

#define HOST_SLC1HOST_TOKEN_RDATA_REG          (DR_REG_SLCHOST_BASE + 0xC4)
/* HOST_SLC1_RX_PF_EOF : RO ;bitpos:[31:28] ;default: 4'h0 ; */
/*description: */
#define HOST_SLC1_RX_PF_EOF  0x0000000F
#define HOST_SLC1_RX_PF_EOF_M  ((HOST_SLC1_RX_PF_EOF_V)<<(HOST_SLC1_RX_PF_EOF_S))
#define HOST_SLC1_RX_PF_EOF_V  0xF
#define HOST_SLC1_RX_PF_EOF_S  28
/* HOST_HOSTSLC1_TOKEN1 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define HOST_HOSTSLC1_TOKEN1  0x00000FFF
#define HOST_HOSTSLC1_TOKEN1_M  ((HOST_HOSTSLC1_TOKEN1_V)<<(HOST_HOSTSLC1_TOKEN1_S))
#define HOST_HOSTSLC1_TOKEN1_V  0xFFF
#define HOST_HOSTSLC1_TOKEN1_S  16
/* HOST_SLC1_RX_PF_VALID : RO ;bitpos:[12] ;default: 1'h0 ; */
/*description: */
#define HOST_SLC1_RX_PF_VALID  (BIT(12))
#define HOST_SLC1_RX_PF_VALID_M  (BIT(12))
#define HOST_SLC1_RX_PF_VALID_V  0x1
#define HOST_SLC1_RX_PF_VALID_S  12
/* HOST_SLC1_TOKEN0 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define HOST_SLC1_TOKEN0  0x00000FFF
#define HOST_SLC1_TOKEN0_M  ((HOST_SLC1_TOKEN0_V)<<(HOST_SLC1_TOKEN0_S))
#define HOST_SLC1_TOKEN0_V  0xFFF
#define HOST_SLC1_TOKEN0_S  0

