foxval/esp-idf/components/soc/esp32c/include/soc/host_reg.h
#define HOST_SLC0HOST_LEN_WD_REG          (DR_REG_SLCHOST_BASE + 0xFC)
/* HOST_SLC0HOST_LEN_WD : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLC0HOST_LEN_WD  0xFFFFFFFF
#define HOST_SLC0HOST_LEN_WD_M  ((HOST_SLC0HOST_LEN_WD_V)<<(HOST_SLC0HOST_LEN_WD_S))
#define HOST_SLC0HOST_LEN_WD_V  0xFFFFFFFF
#define HOST_SLC0HOST_LEN_WD_S  0

#define HOST_SLC_APBWIN_WDATA_REG          (DR_REG_SLCHOST_BASE + 0x100)
/* HOST_SLC_APBWIN_WDATA : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLC_APBWIN_WDATA  0xFFFFFFFF
#define HOST_SLC_APBWIN_WDATA_M  ((HOST_SLC_APBWIN_WDATA_V)<<(HOST_SLC_APBWIN_WDATA_S))
#define HOST_SLC_APBWIN_WDATA_V  0xFFFFFFFF
#define HOST_SLC_APBWIN_WDATA_S  0

#define HOST_SLC_APBWIN_CONF_REG          (DR_REG_SLCHOST_BASE + 0x104)
/* HOST_SLC_APBWIN_BUS : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC_APBWIN_BUS  (BIT(30))
#define HOST_SLC_APBWIN_BUS_M  (BIT(30))
#define HOST_SLC_APBWIN_BUS_V  0x1
#define HOST_SLC_APBWIN_BUS_S  30
/* HOST_SLC_APBWIN_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC_APBWIN_START  (BIT(29))
#define HOST_SLC_APBWIN_START_M  (BIT(29))
#define HOST_SLC_APBWIN_START_V  0x1
#define HOST_SLC_APBWIN_START_S  29
/* HOST_SLC_APBWIN_WR : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC_APBWIN_WR  (BIT(28))
#define HOST_SLC_APBWIN_WR_M  (BIT(28))
#define HOST_SLC_APBWIN_WR_V  0x1
#define HOST_SLC_APBWIN_WR_S  28
/* HOST_SLC_APBWIN_ADDR : R/W ;bitpos:[27:0] ;default: 28'b0 ; */
/*description: */
#define HOST_SLC_APBWIN_ADDR  0x0FFFFFFF
#define HOST_SLC_APBWIN_ADDR_M  ((HOST_SLC_APBWIN_ADDR_V)<<(HOST_SLC_APBWIN_ADDR_S))
#define HOST_SLC_APBWIN_ADDR_V  0xFFFFFFF
#define HOST_SLC_APBWIN_ADDR_S  0

#define HOST_SLC_APBWIN_RDATA_REG          (DR_REG_SLCHOST_BASE + 0x108)
/* HOST_SLC_APBWIN_RDATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define HOST_SLC_APBWIN_RDATA  0xFFFFFFFF
#define HOST_SLC_APBWIN_RDATA_M  ((HOST_SLC_APBWIN_RDATA_V)<<(HOST_SLC_APBWIN_RDATA_S))
#define HOST_SLC_APBWIN_RDATA_V  0xFFFFFFFF
#define HOST_SLC_APBWIN_RDATA_S  0

#define HOST_SLCHOST_RDCLR0_REG          (DR_REG_SLCHOST_BASE + 0x10C)
/* HOST_SLCHOST_SLC0_BIT6_CLRADDR : R/W ;bitpos:[17:9] ;default: 9'h1e0 ; */
/*description: */
#define HOST_SLCHOST_SLC0_BIT6_CLRADDR  0x000001FF
#define HOST_SLCHOST_SLC0_BIT6_CLRADDR_M  ((HOST_SLCHOST_SLC0_BIT6_CLRADDR_V)<<(HOST_SLCHOST_SLC0_BIT6_CLRADDR_S))
#define HOST_SLCHOST_SLC0_BIT6_CLRADDR_V  0x1FF
#define HOST_SLCHOST_SLC0_BIT6_CLRADDR_S  9
/* HOST_SLCHOST_SLC0_BIT7_CLRADDR : R/W ;bitpos:[8:0] ;default: 9'h44 ; */
/*description: */
#define HOST_SLCHOST_SLC0_BIT7_CLRADDR  0x000001FF
#define HOST_SLCHOST_SLC0_BIT7_CLRADDR_M  ((HOST_SLCHOST_SLC0_BIT7_CLRADDR_V)<<(HOST_SLCHOST_SLC0_BIT7_CLRADDR_S))
#define HOST_SLCHOST_SLC0_BIT7_CLRADDR_V  0x1FF
#define HOST_SLCHOST_SLC0_BIT7_CLRADDR_S  0

#define HOST_SLCHOST_RDCLR1_REG          (DR_REG_SLCHOST_BASE + 0x110)
/* HOST_SLCHOST_SLC1_BIT6_CLRADDR : R/W ;bitpos:[17:9] ;default: 9'h1e0 ; */
/*description: */
#define HOST_SLCHOST_SLC1_BIT6_CLRADDR  0x000001FF
#define HOST_SLCHOST_SLC1_BIT6_CLRADDR_M  ((HOST_SLCHOST_SLC1_BIT6_CLRADDR_V)<<(HOST_SLCHOST_SLC1_BIT6_CLRADDR_S))
#define HOST_SLCHOST_SLC1_BIT6_CLRADDR_V  0x1FF
#define HOST_SLCHOST_SLC1_BIT6_CLRADDR_S  9
/* HOST_SLCHOST_SLC1_BIT7_CLRADDR : R/W ;bitpos:[8:0] ;default: 9'h1e0 ; */
/*description: */
#define HOST_SLCHOST_SLC1_BIT7_CLRADDR  0x000001FF
#define HOST_SLCHOST_SLC1_BIT7_CLRADDR_M  ((HOST_SLCHOST_SLC1_BIT7_CLRADDR_V)<<(HOST_SLCHOST_SLC1_BIT7_CLRADDR_S))
#define HOST_SLCHOST_SLC1_BIT7_CLRADDR_V  0x1FF
#define HOST_SLCHOST_SLC1_BIT7_CLRADDR_S  0

#define HOST_SLC0HOST_INT_ENA1_REG          (DR_REG_SLCHOST_BASE + 0x114)
/* HOST_GPIO_SDIO_INT_ENA1 : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_GPIO_SDIO_INT_ENA1  (BIT(25))
#define HOST_GPIO_SDIO_INT_ENA1_M  (BIT(25))
#define HOST_GPIO_SDIO_INT_ENA1_V  0x1
#define HOST_GPIO_SDIO_INT_ENA1_S  25
/* HOST_SLC0_HOST_RD_RETRY_INT_ENA1 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA1  (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA1_M  (BIT(24))
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA1_V  0x1
#define HOST_SLC0_HOST_RD_RETRY_INT_ENA1_S  24
/* HOST_SLC0_RX_NEW_PACKET_INT_ENA1 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA1  (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA1_M  (BIT(23))
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA1_V  0x1
#define HOST_SLC0_RX_NEW_PACKET_INT_ENA1_S  23
/* HOST_SLC0_EXT_BIT3_INT_ENA1 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT3_INT_ENA1  (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_ENA1_M  (BIT(22))
#define HOST_SLC0_EXT_BIT3_INT_ENA1_V  0x1
#define HOST_SLC0_EXT_BIT3_INT_ENA1_S  22
/* HOST_SLC0_EXT_BIT2_INT_ENA1 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT2_INT_ENA1  (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_ENA1_M  (BIT(21))
#define HOST_SLC0_EXT_BIT2_INT_ENA1_V  0x1
#define HOST_SLC0_EXT_BIT2_INT_ENA1_S  21
/* HOST_SLC0_EXT_BIT1_INT_ENA1 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT1_INT_ENA1  (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_ENA1_M  (BIT(20))
#define HOST_SLC0_EXT_BIT1_INT_ENA1_V  0x1
#define HOST_SLC0_EXT_BIT1_INT_ENA1_S  20
/* HOST_SLC0_EXT_BIT0_INT_ENA1 : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_EXT_BIT0_INT_ENA1  (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_ENA1_M  (BIT(19))
#define HOST_SLC0_EXT_BIT0_INT_ENA1_V  0x1
#define HOST_SLC0_EXT_BIT0_INT_ENA1_S  19
/* HOST_SLC0_RX_PF_VALID_INT_ENA1 : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_PF_VALID_INT_ENA1  (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_ENA1_M  (BIT(18))
#define HOST_SLC0_RX_PF_VALID_INT_ENA1_V  0x1
#define HOST_SLC0_RX_PF_VALID_INT_ENA1_S  18
/* HOST_SLC0_TX_OVF_INT_ENA1 : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TX_OVF_INT_ENA1  (BIT(17))
#define HOST_SLC0_TX_OVF_INT_ENA1_M  (BIT(17))
#define HOST_SLC0_TX_OVF_INT_ENA1_V  0x1
#define HOST_SLC0_TX_OVF_INT_ENA1_S  17
/* HOST_SLC0_RX_UDF_INT_ENA1 : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_RX_UDF_INT_ENA1  (BIT(16))
#define HOST_SLC0_RX_UDF_INT_ENA1_M  (BIT(16))
#define HOST_SLC0_RX_UDF_INT_ENA1_V  0x1
#define HOST_SLC0_RX_UDF_INT_ENA1_S  16
/* HOST_SLC0HOST_TX_START_INT_ENA1 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_TX_START_INT_ENA1  (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_ENA1_M  (BIT(15))
#define HOST_SLC0HOST_TX_START_INT_ENA1_V  0x1
#define HOST_SLC0HOST_TX_START_INT_ENA1_S  15
/* HOST_SLC0HOST_RX_START_INT_ENA1 : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_START_INT_ENA1  (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_ENA1_M  (BIT(14))
#define HOST_SLC0HOST_RX_START_INT_ENA1_V  0x1
#define HOST_SLC0HOST_RX_START_INT_ENA1_S  14
/* HOST_SLC0HOST_RX_EOF_INT_ENA1 : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_EOF_INT_ENA1  (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_ENA1_M  (BIT(13))
#define HOST_SLC0HOST_RX_EOF_INT_ENA1_V  0x1
#define HOST_SLC0HOST_RX_EOF_INT_ENA1_S  13
/* HOST_SLC0HOST_RX_SOF_INT_ENA1 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0HOST_RX_SOF_INT_ENA1  (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_ENA1_M  (BIT(12))
#define HOST_SLC0HOST_RX_SOF_INT_ENA1_V  0x1
#define HOST_SLC0HOST_RX_SOF_INT_ENA1_S  12
/* HOST_SLC0_TOKEN1_0TO1_INT_ENA1 : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA1  (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA1_M  (BIT(11))
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA1_V  0x1
#define HOST_SLC0_TOKEN1_0TO1_INT_ENA1_S  11
/* HOST_SLC0_TOKEN0_0TO1_INT_ENA1 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA1  (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA1_M  (BIT(10))
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA1_V  0x1
#define HOST_SLC0_TOKEN0_0TO1_INT_ENA1_S  10
/* HOST_SLC0_TOKEN1_1TO0_INT_ENA1 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA1  (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA1_M  (BIT(9))
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA1_V  0x1
#define HOST_SLC0_TOKEN1_1TO0_INT_ENA1_S  9
/* HOST_SLC0_TOKEN0_1TO0_INT_ENA1 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA1  (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA1_M  (BIT(8))
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA1_V  0x1
#define HOST_SLC0_TOKEN0_1TO0_INT_ENA1_S  8
/* HOST_SLC0_TOHOST_BIT7_INT_ENA1 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT7_INT_ENA1  (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_ENA1_M  (BIT(7))
#define HOST_SLC0_TOHOST_BIT7_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT7_INT_ENA1_S  7
/* HOST_SLC0_TOHOST_BIT6_INT_ENA1 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT6_INT_ENA1  (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_ENA1_M  (BIT(6))
#define HOST_SLC0_TOHOST_BIT6_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT6_INT_ENA1_S  6
/* HOST_SLC0_TOHOST_BIT5_INT_ENA1 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT5_INT_ENA1  (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_ENA1_M  (BIT(5))
#define HOST_SLC0_TOHOST_BIT5_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT5_INT_ENA1_S  5
/* HOST_SLC0_TOHOST_BIT4_INT_ENA1 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT4_INT_ENA1  (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_ENA1_M  (BIT(4))
#define HOST_SLC0_TOHOST_BIT4_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT4_INT_ENA1_S  4
/* HOST_SLC0_TOHOST_BIT3_INT_ENA1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT3_INT_ENA1  (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_ENA1_M  (BIT(3))
#define HOST_SLC0_TOHOST_BIT3_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT3_INT_ENA1_S  3
/* HOST_SLC0_TOHOST_BIT2_INT_ENA1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT2_INT_ENA1  (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_ENA1_M  (BIT(2))
#define HOST_SLC0_TOHOST_BIT2_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT2_INT_ENA1_S  2
/* HOST_SLC0_TOHOST_BIT1_INT_ENA1 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT1_INT_ENA1  (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_ENA1_M  (BIT(1))
#define HOST_SLC0_TOHOST_BIT1_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT1_INT_ENA1_S  1
/* HOST_SLC0_TOHOST_BIT0_INT_ENA1 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC0_TOHOST_BIT0_INT_ENA1  (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_ENA1_M  (BIT(0))
#define HOST_SLC0_TOHOST_BIT0_INT_ENA1_V  0x1
#define HOST_SLC0_TOHOST_BIT0_INT_ENA1_S  0

#define HOST_SLC1HOST_INT_ENA1_REG          (DR_REG_SLCHOST_BASE + 0x118)
/* HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1 : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1  (BIT(25))
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_M  (BIT(25))
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_V  0x1
#define HOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_S  25
/* HOST_SLC1_HOST_RD_RETRY_INT_ENA1 : R/W ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_HOST_RD_RETRY_INT_ENA1  (BIT(24))
#define HOST_SLC1_HOST_RD_RETRY_INT_ENA1_M  (BIT(24))
#define HOST_SLC1_HOST_RD_RETRY_INT_ENA1_V  0x1
#define HOST_SLC1_HOST_RD_RETRY_INT_ENA1_S  24
/* HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1  (BIT(23))
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_M  (BIT(23))
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_V  0x1
#define HOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_S  23
/* HOST_SLC1_EXT_BIT3_INT_ENA1 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT3_INT_ENA1  (BIT(22))
#define HOST_SLC1_EXT_BIT3_INT_ENA1_M  (BIT(22))
#define HOST_SLC1_EXT_BIT3_INT_ENA1_V  0x1
#define HOST_SLC1_EXT_BIT3_INT_ENA1_S  22
/* HOST_SLC1_EXT_BIT2_INT_ENA1 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT2_INT_ENA1  (BIT(21))
#define HOST_SLC1_EXT_BIT2_INT_ENA1_M  (BIT(21))
#define HOST_SLC1_EXT_BIT2_INT_ENA1_V  0x1
#define HOST_SLC1_EXT_BIT2_INT_ENA1_S  21
/* HOST_SLC1_EXT_BIT1_INT_ENA1 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT1_INT_ENA1  (BIT(20))
#define HOST_SLC1_EXT_BIT1_INT_ENA1_M  (BIT(20))
#define HOST_SLC1_EXT_BIT1_INT_ENA1_V  0x1
#define HOST_SLC1_EXT_BIT1_INT_ENA1_S  20
/* HOST_SLC1_EXT_BIT0_INT_ENA1 : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_EXT_BIT0_INT_ENA1  (BIT(19))
#define HOST_SLC1_EXT_BIT0_INT_ENA1_M  (BIT(19))
#define HOST_SLC1_EXT_BIT0_INT_ENA1_V  0x1
#define HOST_SLC1_EXT_BIT0_INT_ENA1_S  19
/* HOST_SLC1_RX_PF_VALID_INT_ENA1 : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_RX_PF_VALID_INT_ENA1  (BIT(18))
#define HOST_SLC1_RX_PF_VALID_INT_ENA1_M  (BIT(18))
#define HOST_SLC1_RX_PF_VALID_INT_ENA1_V  0x1
#define HOST_SLC1_RX_PF_VALID_INT_ENA1_S  18
/* HOST_SLC1_TX_OVF_INT_ENA1 : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TX_OVF_INT_ENA1  (BIT(17))
#define HOST_SLC1_TX_OVF_INT_ENA1_M  (BIT(17))
#define HOST_SLC1_TX_OVF_INT_ENA1_V  0x1
#define HOST_SLC1_TX_OVF_INT_ENA1_S  17
/* HOST_SLC1_RX_UDF_INT_ENA1 : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_RX_UDF_INT_ENA1  (BIT(16))
#define HOST_SLC1_RX_UDF_INT_ENA1_M  (BIT(16))
#define HOST_SLC1_RX_UDF_INT_ENA1_V  0x1
#define HOST_SLC1_RX_UDF_INT_ENA1_S  16
/* HOST_SLC1HOST_TX_START_INT_ENA1 : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_TX_START_INT_ENA1  (BIT(15))
#define HOST_SLC1HOST_TX_START_INT_ENA1_M  (BIT(15))
#define HOST_SLC1HOST_TX_START_INT_ENA1_V  0x1
#define HOST_SLC1HOST_TX_START_INT_ENA1_S  15
/* HOST_SLC1HOST_RX_START_INT_ENA1 : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_RX_START_INT_ENA1  (BIT(14))
#define HOST_SLC1HOST_RX_START_INT_ENA1_M  (BIT(14))
#define HOST_SLC1HOST_RX_START_INT_ENA1_V  0x1
#define HOST_SLC1HOST_RX_START_INT_ENA1_S  14
/* HOST_SLC1HOST_RX_EOF_INT_ENA1 : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_RX_EOF_INT_ENA1  (BIT(13))
#define HOST_SLC1HOST_RX_EOF_INT_ENA1_M  (BIT(13))
#define HOST_SLC1HOST_RX_EOF_INT_ENA1_V  0x1
#define HOST_SLC1HOST_RX_EOF_INT_ENA1_S  13
/* HOST_SLC1HOST_RX_SOF_INT_ENA1 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1HOST_RX_SOF_INT_ENA1  (BIT(12))
#define HOST_SLC1HOST_RX_SOF_INT_ENA1_M  (BIT(12))
#define HOST_SLC1HOST_RX_SOF_INT_ENA1_V  0x1
#define HOST_SLC1HOST_RX_SOF_INT_ENA1_S  12
/* HOST_SLC1_TOKEN1_0TO1_INT_ENA1 : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN1_0TO1_INT_ENA1  (BIT(11))
#define HOST_SLC1_TOKEN1_0TO1_INT_ENA1_M  (BIT(11))
#define HOST_SLC1_TOKEN1_0TO1_INT_ENA1_V  0x1
#define HOST_SLC1_TOKEN1_0TO1_INT_ENA1_S  11
/* HOST_SLC1_TOKEN0_0TO1_INT_ENA1 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN0_0TO1_INT_ENA1  (BIT(10))
#define HOST_SLC1_TOKEN0_0TO1_INT_ENA1_M  (BIT(10))
#define HOST_SLC1_TOKEN0_0TO1_INT_ENA1_V  0x1
#define HOST_SLC1_TOKEN0_0TO1_INT_ENA1_S  10
/* HOST_SLC1_TOKEN1_1TO0_INT_ENA1 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN1_1TO0_INT_ENA1  (BIT(9))
#define HOST_SLC1_TOKEN1_1TO0_INT_ENA1_M  (BIT(9))
#define HOST_SLC1_TOKEN1_1TO0_INT_ENA1_V  0x1
#define HOST_SLC1_TOKEN1_1TO0_INT_ENA1_S  9
/* HOST_SLC1_TOKEN0_1TO0_INT_ENA1 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOKEN0_1TO0_INT_ENA1  (BIT(8))
#define HOST_SLC1_TOKEN0_1TO0_INT_ENA1_M  (BIT(8))
#define HOST_SLC1_TOKEN0_1TO0_INT_ENA1_V  0x1
#define HOST_SLC1_TOKEN0_1TO0_INT_ENA1_S  8
/* HOST_SLC1_TOHOST_BIT7_INT_ENA1 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT7_INT_ENA1  (BIT(7))
#define HOST_SLC1_TOHOST_BIT7_INT_ENA1_M  (BIT(7))
#define HOST_SLC1_TOHOST_BIT7_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT7_INT_ENA1_S  7
/* HOST_SLC1_TOHOST_BIT6_INT_ENA1 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT6_INT_ENA1  (BIT(6))
#define HOST_SLC1_TOHOST_BIT6_INT_ENA1_M  (BIT(6))
#define HOST_SLC1_TOHOST_BIT6_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT6_INT_ENA1_S  6
/* HOST_SLC1_TOHOST_BIT5_INT_ENA1 : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT5_INT_ENA1  (BIT(5))
#define HOST_SLC1_TOHOST_BIT5_INT_ENA1_M  (BIT(5))
#define HOST_SLC1_TOHOST_BIT5_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT5_INT_ENA1_S  5
/* HOST_SLC1_TOHOST_BIT4_INT_ENA1 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT4_INT_ENA1  (BIT(4))
#define HOST_SLC1_TOHOST_BIT4_INT_ENA1_M  (BIT(4))
#define HOST_SLC1_TOHOST_BIT4_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT4_INT_ENA1_S  4
/* HOST_SLC1_TOHOST_BIT3_INT_ENA1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT3_INT_ENA1  (BIT(3))
#define HOST_SLC1_TOHOST_BIT3_INT_ENA1_M  (BIT(3))
#define HOST_SLC1_TOHOST_BIT3_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT3_INT_ENA1_S  3
/* HOST_SLC1_TOHOST_BIT2_INT_ENA1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT2_INT_ENA1  (BIT(2))
#define HOST_SLC1_TOHOST_BIT2_INT_ENA1_M  (BIT(2))
#define HOST_SLC1_TOHOST_BIT2_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT2_INT_ENA1_S  2
/* HOST_SLC1_TOHOST_BIT1_INT_ENA1 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT1_INT_ENA1  (BIT(1))
#define HOST_SLC1_TOHOST_BIT1_INT_ENA1_M  (BIT(1))
#define HOST_SLC1_TOHOST_BIT1_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT1_INT_ENA1_S  1
/* HOST_SLC1_TOHOST_BIT0_INT_ENA1 : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define HOST_SLC1_TOHOST_BIT0_INT_ENA1  (BIT(0))
#define HOST_SLC1_TOHOST_BIT0_INT_ENA1_M  (BIT(0))
#define HOST_SLC1_TOHOST_BIT0_INT_ENA1_V  0x1
#define HOST_SLC1_TOHOST_BIT0_INT_ENA1_S  0

